app/Http/Controllers/FlightController.php

    public function main() {
        $airports = Airport::all();
---
select * from `airports`

    public function index(Request $request)
    {
        $maxPerPage = 20;

        $totalFlights = Flight::count();
        $searchQuery = $request->input('search');

        $perPage = min($request->get('per-page', 5), $maxPerPage);

        $query = Flight::query();
        if ($searchQuery) {
            $query->where('flight_id', 'like', '%' . $searchQuery . '%')
                ->orWhere('from_location', 'like', '%' . $searchQuery . '%')
                ->orWhere('to_location', 'like', '%' . $searchQuery . '%')
                ->orWhere('departure_datetime', 'like', '%' . $searchQuery . '%')
                ->orWhere('arrival_datetime', 'like', '%' . $searchQuery . '%')
                ->orWhere('duration', 'like', '%' . $searchQuery . '%')
                ->orWhere('plane_id', 'like', '%' . $searchQuery . '%')
                ->orWhere('available_seats', 'like', '%' . $searchQuery . '%');
        }

        $flights = $query->paginate($perPage);
---
select count(*) as aggregate from `flights`