app/Http/Controllers/MessageController.php

insert into `messages` (`name`, `email`, `phone`, `subject`, `message`, `updated_at`, `created_at`) values ('zaid', 'zz@zz', '1', '1', 'f', '2024-09-07 18:48:28', '2024-09-07 18:48:28')
---
    public function store(Request $request)
    {
        // تحقق من صحة البيانات
        $request->validate([
            'name' => 'required|string|max:255',
            'email' => 'required|email|max:255',
            'phone' => 'required|numeric',
            'subject' => 'required|string',
            'message' => 'required|string',
        ]);

        // حفظ الرسالة في قاعدة البيانات
        Message::create([
            'name' => $request->name,
            'email' => $request->email,
            'phone' => $request->phone,
            'subject' => $request->subject,
            'message' => $request->message,
        ]);