app/Http/Controllers/RegisteredUserController.php

    public function store() {

      $validated =  request()->validate([
        'name'=> ["required"],
        'email'=> ["required",'email'],
        'password'=> ["required",'confirmed'],
       ]);


      $user= User::create($validated);
---
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('zaid', 'zz@zz', '$2y$12$pb/btn6wEbmOaAeEg1yPfe1yRv/gYZENN0vTZWFAyA.cLzZHyHRqy', '2024-09-07 12:58:14', '2024-09-07 12:58:14')